test/load/results/medium-load-20260625-061652/report.txt
Requests      [total, rate, throughput]         6000, 200.04, 1.60
Duration      [total, attack, wait]             59.996s, 29.994s, 30.002s
Latencies     [min, mean, 50, 90, 95, 99, max]  184.8µs, 29.524s, 30.001s, 30.006s, 30.012s, 30.059s, 30.221s
Bytes In      [total, mean]                     21408, 3.57
Bytes Out     [total, mean]                     6912, 1.15
Success       [ratio]                           1.60%
Status Codes  [code:count]                      0:5904  200:96  
Error Set:
Post "http://127.0.0.1:3099/v1/chat/completions": context deadline exceeded (Client.Timeout exceeded while awaiting headers)